###################################################################

# Created by write_sdc on Fri Oct 13 12:00:18 2023

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_wire_load_mode segmented
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports clk]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports control]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {data_arr[0]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[31]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[30]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[29]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[28]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[27]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[26]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[25]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[24]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[23]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[22]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[21]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[20]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[19]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[18]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[17]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[16]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[15]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[14]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[13]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[12]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[11]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[10]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[9]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[8]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[7]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[6]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[5]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[4]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[3]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[2]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[1]}]
set_driving_cell -lib_cell INVx3_ASAP7_75t_R [get_ports {wt_arr[0]}]
set_load -pin_load 0.01 [get_ports {acc_out[127]}]
set_load -pin_load 0.01 [get_ports {acc_out[126]}]
set_load -pin_load 0.01 [get_ports {acc_out[125]}]
set_load -pin_load 0.01 [get_ports {acc_out[124]}]
set_load -pin_load 0.01 [get_ports {acc_out[123]}]
set_load -pin_load 0.01 [get_ports {acc_out[122]}]
set_load -pin_load 0.01 [get_ports {acc_out[121]}]
set_load -pin_load 0.01 [get_ports {acc_out[120]}]
set_load -pin_load 0.01 [get_ports {acc_out[119]}]
set_load -pin_load 0.01 [get_ports {acc_out[118]}]
set_load -pin_load 0.01 [get_ports {acc_out[117]}]
set_load -pin_load 0.01 [get_ports {acc_out[116]}]
set_load -pin_load 0.01 [get_ports {acc_out[115]}]
set_load -pin_load 0.01 [get_ports {acc_out[114]}]
set_load -pin_load 0.01 [get_ports {acc_out[113]}]
set_load -pin_load 0.01 [get_ports {acc_out[112]}]
set_load -pin_load 0.01 [get_ports {acc_out[111]}]
set_load -pin_load 0.01 [get_ports {acc_out[110]}]
set_load -pin_load 0.01 [get_ports {acc_out[109]}]
set_load -pin_load 0.01 [get_ports {acc_out[108]}]
set_load -pin_load 0.01 [get_ports {acc_out[107]}]
set_load -pin_load 0.01 [get_ports {acc_out[106]}]
set_load -pin_load 0.01 [get_ports {acc_out[105]}]
set_load -pin_load 0.01 [get_ports {acc_out[104]}]
set_load -pin_load 0.01 [get_ports {acc_out[103]}]
set_load -pin_load 0.01 [get_ports {acc_out[102]}]
set_load -pin_load 0.01 [get_ports {acc_out[101]}]
set_load -pin_load 0.01 [get_ports {acc_out[100]}]
set_load -pin_load 0.01 [get_ports {acc_out[99]}]
set_load -pin_load 0.01 [get_ports {acc_out[98]}]
set_load -pin_load 0.01 [get_ports {acc_out[97]}]
set_load -pin_load 0.01 [get_ports {acc_out[96]}]
set_load -pin_load 0.01 [get_ports {acc_out[95]}]
set_load -pin_load 0.01 [get_ports {acc_out[94]}]
set_load -pin_load 0.01 [get_ports {acc_out[93]}]
set_load -pin_load 0.01 [get_ports {acc_out[92]}]
set_load -pin_load 0.01 [get_ports {acc_out[91]}]
set_load -pin_load 0.01 [get_ports {acc_out[90]}]
set_load -pin_load 0.01 [get_ports {acc_out[89]}]
set_load -pin_load 0.01 [get_ports {acc_out[88]}]
set_load -pin_load 0.01 [get_ports {acc_out[87]}]
set_load -pin_load 0.01 [get_ports {acc_out[86]}]
set_load -pin_load 0.01 [get_ports {acc_out[85]}]
set_load -pin_load 0.01 [get_ports {acc_out[84]}]
set_load -pin_load 0.01 [get_ports {acc_out[83]}]
set_load -pin_load 0.01 [get_ports {acc_out[82]}]
set_load -pin_load 0.01 [get_ports {acc_out[81]}]
set_load -pin_load 0.01 [get_ports {acc_out[80]}]
set_load -pin_load 0.01 [get_ports {acc_out[79]}]
set_load -pin_load 0.01 [get_ports {acc_out[78]}]
set_load -pin_load 0.01 [get_ports {acc_out[77]}]
set_load -pin_load 0.01 [get_ports {acc_out[76]}]
set_load -pin_load 0.01 [get_ports {acc_out[75]}]
set_load -pin_load 0.01 [get_ports {acc_out[74]}]
set_load -pin_load 0.01 [get_ports {acc_out[73]}]
set_load -pin_load 0.01 [get_ports {acc_out[72]}]
set_load -pin_load 0.01 [get_ports {acc_out[71]}]
set_load -pin_load 0.01 [get_ports {acc_out[70]}]
set_load -pin_load 0.01 [get_ports {acc_out[69]}]
set_load -pin_load 0.01 [get_ports {acc_out[68]}]
set_load -pin_load 0.01 [get_ports {acc_out[67]}]
set_load -pin_load 0.01 [get_ports {acc_out[66]}]
set_load -pin_load 0.01 [get_ports {acc_out[65]}]
set_load -pin_load 0.01 [get_ports {acc_out[64]}]
set_load -pin_load 0.01 [get_ports {acc_out[63]}]
set_load -pin_load 0.01 [get_ports {acc_out[62]}]
set_load -pin_load 0.01 [get_ports {acc_out[61]}]
set_load -pin_load 0.01 [get_ports {acc_out[60]}]
set_load -pin_load 0.01 [get_ports {acc_out[59]}]
set_load -pin_load 0.01 [get_ports {acc_out[58]}]
set_load -pin_load 0.01 [get_ports {acc_out[57]}]
set_load -pin_load 0.01 [get_ports {acc_out[56]}]
set_load -pin_load 0.01 [get_ports {acc_out[55]}]
set_load -pin_load 0.01 [get_ports {acc_out[54]}]
set_load -pin_load 0.01 [get_ports {acc_out[53]}]
set_load -pin_load 0.01 [get_ports {acc_out[52]}]
set_load -pin_load 0.01 [get_ports {acc_out[51]}]
set_load -pin_load 0.01 [get_ports {acc_out[50]}]
set_load -pin_load 0.01 [get_ports {acc_out[49]}]
set_load -pin_load 0.01 [get_ports {acc_out[48]}]
set_load -pin_load 0.01 [get_ports {acc_out[47]}]
set_load -pin_load 0.01 [get_ports {acc_out[46]}]
set_load -pin_load 0.01 [get_ports {acc_out[45]}]
set_load -pin_load 0.01 [get_ports {acc_out[44]}]
set_load -pin_load 0.01 [get_ports {acc_out[43]}]
set_load -pin_load 0.01 [get_ports {acc_out[42]}]
set_load -pin_load 0.01 [get_ports {acc_out[41]}]
set_load -pin_load 0.01 [get_ports {acc_out[40]}]
set_load -pin_load 0.01 [get_ports {acc_out[39]}]
set_load -pin_load 0.01 [get_ports {acc_out[38]}]
set_load -pin_load 0.01 [get_ports {acc_out[37]}]
set_load -pin_load 0.01 [get_ports {acc_out[36]}]
set_load -pin_load 0.01 [get_ports {acc_out[35]}]
set_load -pin_load 0.01 [get_ports {acc_out[34]}]
set_load -pin_load 0.01 [get_ports {acc_out[33]}]
set_load -pin_load 0.01 [get_ports {acc_out[32]}]
set_load -pin_load 0.01 [get_ports {acc_out[31]}]
set_load -pin_load 0.01 [get_ports {acc_out[30]}]
set_load -pin_load 0.01 [get_ports {acc_out[29]}]
set_load -pin_load 0.01 [get_ports {acc_out[28]}]
set_load -pin_load 0.01 [get_ports {acc_out[27]}]
set_load -pin_load 0.01 [get_ports {acc_out[26]}]
set_load -pin_load 0.01 [get_ports {acc_out[25]}]
set_load -pin_load 0.01 [get_ports {acc_out[24]}]
set_load -pin_load 0.01 [get_ports {acc_out[23]}]
set_load -pin_load 0.01 [get_ports {acc_out[22]}]
set_load -pin_load 0.01 [get_ports {acc_out[21]}]
set_load -pin_load 0.01 [get_ports {acc_out[20]}]
set_load -pin_load 0.01 [get_ports {acc_out[19]}]
set_load -pin_load 0.01 [get_ports {acc_out[18]}]
set_load -pin_load 0.01 [get_ports {acc_out[17]}]
set_load -pin_load 0.01 [get_ports {acc_out[16]}]
set_load -pin_load 0.01 [get_ports {acc_out[15]}]
set_load -pin_load 0.01 [get_ports {acc_out[14]}]
set_load -pin_load 0.01 [get_ports {acc_out[13]}]
set_load -pin_load 0.01 [get_ports {acc_out[12]}]
set_load -pin_load 0.01 [get_ports {acc_out[11]}]
set_load -pin_load 0.01 [get_ports {acc_out[10]}]
set_load -pin_load 0.01 [get_ports {acc_out[9]}]
set_load -pin_load 0.01 [get_ports {acc_out[8]}]
set_load -pin_load 0.01 [get_ports {acc_out[7]}]
set_load -pin_load 0.01 [get_ports {acc_out[6]}]
set_load -pin_load 0.01 [get_ports {acc_out[5]}]
set_load -pin_load 0.01 [get_ports {acc_out[4]}]
set_load -pin_load 0.01 [get_ports {acc_out[3]}]
set_load -pin_load 0.01 [get_ports {acc_out[2]}]
set_load -pin_load 0.01 [get_ports {acc_out[1]}]
set_load -pin_load 0.01 [get_ports {acc_out[0]}]
create_clock [get_ports clk]  -period 1100  -waveform {0 550}
set_clock_uncertainty 0.01  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports control]
set_input_delay -clock clk  0.1  [get_ports {data_arr[31]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[30]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[29]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[28]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[27]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[26]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[25]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[24]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[23]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[22]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[21]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[20]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[19]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[18]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[17]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[16]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[15]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[14]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[13]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[12]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[11]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[10]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[9]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[8]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[7]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[6]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[5]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[4]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[3]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[2]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[1]}]
set_input_delay -clock clk  0.1  [get_ports {data_arr[0]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[31]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[30]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[29]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[28]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[27]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[26]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[25]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[24]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[23]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[22]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[21]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[20]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[19]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[18]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[17]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[16]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[15]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[14]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[13]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[12]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[11]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[10]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[9]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[8]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[7]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[6]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[5]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[4]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[3]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[2]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[1]}]
set_input_delay -clock clk  0.1  [get_ports {wt_arr[0]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[127]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[126]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[125]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[124]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[123]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[122]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[121]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[120]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[119]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[118]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[117]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[116]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[115]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[114]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[113]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[112]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[111]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[110]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[109]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[108]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[107]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[106]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[105]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[104]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[103]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[102]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[101]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[100]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[99]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[98]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[97]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[96]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[95]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[94]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[93]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[92]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[91]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[90]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[89]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[88]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[87]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[86]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[85]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[84]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[83]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[82]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[81]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[80]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[79]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[78]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[77]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[76]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[75]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[74]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[73]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[72]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[71]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[70]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[69]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[68]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[67]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[66]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[65]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[64]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[63]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[62]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[61]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[60]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[59]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[58]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[57]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[56]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[55]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[54]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[53]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[52]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[51]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[50]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[49]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[48]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[47]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[46]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[45]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[44]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[43]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[42]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[41]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[40]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[39]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[38]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[37]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[36]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[35]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[34]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[33]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[32]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[31]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[30]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[29]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[28]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[27]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[26]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[25]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[24]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[23]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[22]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[21]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[20]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[19]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[18]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[17]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[16]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[15]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[14]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[13]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[12]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[11]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[10]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[9]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[8]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[7]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[6]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[5]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[4]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[3]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[2]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[1]}]
set_output_delay -clock clk  0.1  [get_ports {acc_out[0]}]
